AkitaEngineering/ESP32-C3-Reticulum-Node/include/Config.h
#ifndef CONFIG_H
#define CONFIG_H

#include <Arduino.h>
#include <IPAddress.h>
#include <vector>
#include <array> // For group addresses

#ifndef FIRMWARE_VERSION
#define FIRMWARE_VERSION "0.3.2"
#endif

#ifndef PRODUCTION_BUILD
#define PRODUCTION_BUILD 0
#endif

// --- LED Configuration ---
// Provide a fallback for boards that don't define LED_BUILTIN
#ifndef LED_BUILTIN
#define LED_BUILTIN 2  // Common default for many ESP32 boards
#endif

inline void initStatusLed() {
#if !defined(RGB_BUILTIN)
    pinMode(LED_BUILTIN, OUTPUT);
#endif
}

inline void setStatusLed(bool on) {
#if defined(RGB_BUILTIN)
    neopixelWrite(RGB_BUILTIN, 0, 0, on ? 20 : 0);
#else
    digitalWrite(LED_BUILTIN, on ? HIGH : LOW);
#endif
}

// --- Debug and Interface Configuration ---
// Serial port selection can be swapped at compile time. By default
// the USB/UART0 port (Serial) is used for debug and a hardware UART
// (Serial1/Serial2) is used for the KISS data interface. This keeps
// debug traffic separate from KISS frames. If you want to run KISS
// directly over the USB CDC connection you can compile with
// -DKISS_OVER_USB=1. Doing so will move debug output to Serial1 and
// use Serial (USB) for KISS. Be aware that mixing debug text with
// KISS packets may corrupt the data stream unless debugging is kept
// very quiet or disabled.

#ifndef DEBUG_ENABLED
#define DEBUG_ENABLED 1  // Set to 1 to enable debug logging
#endif

// Choose which physical Serial port the debug shim will wrap. The
// default is USB serial (Serial) but using KISS_OVER_USB will switch
// it to Serial1 so the USB port is free for KISS traffic.
#ifndef DEBUG_PORT
    #ifdef KISS_OVER_USB
        #define DEBUG_PORT Serial1
    #else
        #define DEBUG_PORT Serial
    #endif
#endif

// When KISS_OVER_USB is active, debug goes to a hardware UART.  We define
// the debug UART pin numbers BEFORE the DebugSerialShim class so they are
// visible inside the begin() method.
#if defined(KISS_OVER_USB)
    #if defined(CONFIG_IDF_TARGET_ESP32C3)
        #ifndef DEBUG_UART_RX
        #define DEBUG_UART_RX 2
        #endif
        #ifndef DEBUG_UART_TX
        #define DEBUG_UART_TX 4
        #endif
    #else
        #ifndef DEBUG_UART_RX
        #define DEBUG_UART_RX -1
        #endif
        #ifndef DEBUG_UART_TX
        #define DEBUG_UART_TX -1
        #endif
    #endif
#endif

// Debug serial shim: when DEBUG_ENABLED is 0, debug output is suppressed while
// still allowing code to compile unchanged.
class DebugSerialShim : public Stream {
public:
    void begin(unsigned long baud) {
        if (!DEBUG_ENABLED) {
            return;
        }

        // initialize whichever serial port is configured for debugging
#if defined(KISS_OVER_USB) && defined(DEBUG_UART_RX) && (DEBUG_UART_RX >= 0)
        // When KISS owns the USB CDC port, debug goes to a hardware UART.
        // We MUST supply explicit pin numbers to avoid clobbering the USB
        // D+/D− GPIOs (the default UART1 pins on ESP32-C3 are 18/19).
        DEBUG_PORT.begin(baud, SERIAL_8N1, DEBUG_UART_RX, DEBUG_UART_TX);
#else
        DEBUG_PORT.begin(baud);
#endif
    }

    int available() override { return DEBUG_ENABLED ? DEBUG_PORT.available() : 0; }
    int read() override { return DEBUG_ENABLED ? DEBUG_PORT.read() : -1; }
    int peek() override { return DEBUG_ENABLED ? DEBUG_PORT.peek() : -1; }
    void flush() override { if (DEBUG_ENABLED) DEBUG_PORT.flush(); }
    size_t write(uint8_t b) override { return DEBUG_ENABLED ? DEBUG_PORT.write(b) : 1; }
    size_t write(const uint8_t *buffer, size_t size) override {
        return DEBUG_ENABLED ? DEBUG_PORT.write(buffer, size) : size;
    }
};

extern DebugSerialShim DebugSerial; // Use USB/UART0 for debug (Arduino Serial Monitor)

// Platform-specific UART configuration
// ESP32-C3, ESP32-C5, ESP32-C6: Only UART0 and UART1 (no UART2)
// ESP32, ESP32-S2, ESP32-S3: UART0, UART1, and UART2
#if defined(KISS_OVER_USB)
    // If we're running KISS over the USB CDC port, just alias the
    // primary Serial object as the KISS transport.  No external pins
    // are required.  Debug output will be moved to Serial1 by the
    // DEBUG_PORT mechanics above.
    #define KissSerial Serial
    // RX/TX pin defines are unused when using USB, but define them anyway
    #define KISS_UART_RX 0
    #define KISS_UART_TX 0

    // DEBUG_UART_RX/TX are now defined above (before DebugSerialShim)

#elif defined(CONFIG_IDF_TARGET_ESP32C3) || defined(CONFIG_IDF_TARGET_ESP32C5) || defined(CONFIG_IDF_TARGET_ESP32C6)
    #define KissSerial Serial1    // Use UART1 for KISS
    #if defined(CONFIG_IDF_TARGET_ESP32C3)
        // On the ESP32-C3 the native USB D+/D- lines are on GPIO18/19.  Using
        // the UART1 default pins (18/19) for the KISS interface will reconfigure
        // the USB pins and disconnect the CDC port immediately after it
        // enumerates, causing the host to report an "unknown device" and
        // produce a beep.  Map UART1 to alternate GPIOs that are free by
        // default (e.g. GPIO2/GPIO4) so USB can remain intact.  These choices
        // can be overridden if your hardware requires different pins.
        #define KISS_UART_RX 2    // alternate pin for UART1 RX (not USB)
        #define KISS_UART_TX 4    // alternate pin for UART1 TX (not USB)
    #elif defined(CONFIG_IDF_TARGET_ESP32C5)
        #define KISS_UART_RX 18   // ESP32-C5 UART1 default RX pin
        #define KISS_UART_TX 19   // ESP32-C5 UART1 default TX pin
    #elif defined(CONFIG_IDF_TARGET_ESP32C6)
        #define KISS_UART_RX 18   // ESP32-C6 UART1 default RX pin
        #define KISS_UART_TX 19   // ESP32-C6 UART1 default TX pin
    #endif
#else
    // Default: prefer a UART that exists on the target. ESP32-S2 does not
    // provide a Serial2 in the Arduino core, so use Serial1 there. ESP32-S3
    // and original ESP32 typically provide Serial2.
    #if defined(CONFIG_IDF_TARGET_ESP32S2)
        #define KissSerial Serial1    // Use UART1 for KISS on ESP32-S2
        #define KISS_UART_RX 33       // ESP32-S2 UART1 RX pin (adjust if needed)
        #define KISS_UART_TX 34       // ESP32-S2 UART1 TX pin (adjust if needed)
    #elif defined(CONFIG_IDF_TARGET_ESP32S3)
        #define KissSerial Serial2    // Use UART2 for KISS
        #define KISS_UART_RX 17       // ESP32-S3 UART2 RX pin
        #define KISS_UART_TX 18       // ESP32-S3 UART2 TX pin
    #else
        #define KissSerial Serial2    // Use UART2 for KISS (ESP32 original)
        #define KISS_UART_RX 16      // ESP32 (original) UART2 RX pin
        #define KISS_UART_TX 17      // ESP32 (original) UART2 TX pin
    #endif
#endif

