AkitaEngineering/ESP32-C3-Reticulum-Node/include/Config.h
// Bluetooth availability
// Conservative whitelist: only the original ESP32 (Xtensa core) is known to
// reliably provide Bluetooth Classic in the Arduino/IDF builds used here.
// Treat all other IDF targets as not having Classic to avoid compiling code
// that depends on Classic-only APIs on cores that only provide BLE or no BT.
#if defined(CONFIG_IDF_TARGET_ESP32)
    #define BLUETOOTH_CLASSIC_AVAILABLE 1
#else
    #define BLUETOOTH_CLASSIC_AVAILABLE 0
#endif

#define KISS_SERIAL_SPEED 115200

// Demo traffic configuration (disabled by default for production)
#ifndef DEMO_TRAFFIC_ENABLED
#define DEMO_TRAFFIC_ENABLED 0
#endif

// --- Runtime features & Web UI (disabled by default) ---
// Enable a lightweight Web UI + REST API for status/config (requires enabling and adding AsyncWebServer to build flags)
#ifndef WEBSERVER_ENABLED
#define WEBSERVER_ENABLED 0
#endif

// Enable runtime JSON config persisted in LittleFS/SPIFFS
#ifndef JSON_CONFIG_ENABLED
#define JSON_CONFIG_ENABLED 0
#endif

// Enable secure OTA (signed updates) support (requires OTA code + signature checks)
#ifndef OTA_ENABLED
#define OTA_ENABLED 0
#endif

// sanity checks for feature combinations
#if WEBSERVER_ENABLED && !JSON_CONFIG_ENABLED
    #error "WEBSERVER_ENABLED requires JSON_CONFIG_ENABLED for runtime config"
#endif
#if WEBSERVER_ENABLED && !OTA_ENABLED
    #error "WEBSERVER_ENABLED should accompany OTA_ENABLED to provide firmware updates"
#endif
#if OTA_ENABLED && !JSON_CONFIG_ENABLED
    #warning "OTA_ENABLED without JSON_CONFIG_ENABLED means updates cannot be disabled/controlled at runtime"
#endif
#ifndef WEBSERVER_PORT
#define WEBSERVER_PORT 80
#endif

// Web UI authentication (Bearer token). When enabled and a token is present
// in the runtime JSON config the REST API will require Authorization: Bearer <token>
#ifndef WEBSERVER_AUTH_ENABLED
#define WEBSERVER_AUTH_ENABLED 1
#endif

#if PRODUCTION_BUILD
    #if !WEBSERVER_ENABLED
        #error "PRODUCTION_BUILD requires WEBSERVER_ENABLED"
    #endif
    #if !JSON_CONFIG_ENABLED
        #error "PRODUCTION_BUILD requires JSON_CONFIG_ENABLED"
    #endif
    #if !OTA_ENABLED
        #error "PRODUCTION_BUILD requires OTA_ENABLED"
    #endif
    #if !WEBSERVER_AUTH_ENABLED
        #error "PRODUCTION_BUILD requires bearer authentication"
    #endif
    #if DEBUG_ENABLED
        #error "PRODUCTION_BUILD requires DEBUG_ENABLED=0"
    #endif
    #if DEMO_TRAFFIC_ENABLED
        #error "PRODUCTION_BUILD requires DEMO_TRAFFIC_ENABLED=0"
    #endif
#endif

// BLE provisioning (GATT) for WiFi / callsign setup.
// Reserved compile-time surface only — there is no GATT implementation.
#ifndef BLE_PROVISIONING_ENABLED
#define BLE_PROVISIONING_ENABLED 0
#endif
#if BLE_PROVISIONING_ENABLED
#error "BLE_PROVISIONING_ENABLED is reserved; no GATT provisioning service exists"
#endif

// Runtime metrics endpoint (JSON) and adjustable log levels
#ifndef METRICS_ENABLED
#define METRICS_ENABLED 0
#endif

// Metrics/telemetry configuration
#ifndef METRICS_UDP_ENABLED
#define METRICS_UDP_ENABLED 0    // unauthenticated UDP metrics are off unless explicitly enabled
#endif
#ifndef METRICS_UDP_PORT
#define METRICS_UDP_PORT 4243    // port used for UDP metrics broadcasts
#endif
// interval for sending UDP metrics (usually same as MEM_CHECK_INTERVAL_MS)
#ifndef METRICS_INTERVAL_MS
#define METRICS_INTERVAL_MS (MEM_CHECK_INTERVAL_MS)
#endif

// Keep WiFi radio active for ESP-NOW, but optionally skip STA/AP association.
// 0 = ESP-NOW-only mode (default), 1 = connect to AP if credentials are set.
#ifndef WIFI_STA_CONNECT_ENABLED
#define WIFI_STA_CONNECT_ENABLED 0
#endif

// In mesh mode, broadcast all ESP-NOW payloads rather than route-unicast.
// This makes nodes behave as symmetric transceivers and avoids route stickiness.
#ifndef ESP_NOW_INDISCRIMINATE_BROADCAST
#define ESP_NOW_INDISCRIMINATE_BROADCAST 1
#endif

// Add CRC32 over fully reassembled fragmented ESP-NOW payloads.
// This provides end-to-end integrity for the fragment set.
#ifndef ESPNOW_FRAGMENT_CRC32_ENABLED
#define ESPNOW_FRAGMENT_CRC32_ENABLED 1
#endif

// Enable bounded in-memory store-and-forward retries for ESP-NOW send failures.
#ifndef ESPNOW_STORE_FORWARD_ENABLED
#define ESPNOW_STORE_FORWARD_ENABLED 1
#endif

#ifndef ESPNOW_SF_QUEUE_SIZE
#define ESPNOW_SF_QUEUE_SIZE 24
#endif

#ifndef ESPNOW_SF_RETRY_MS
#define ESPNOW_SF_RETRY_MS 300
#endif

#ifndef ESPNOW_SF_MAX_ATTEMPTS
#define ESPNOW_SF_MAX_ATTEMPTS 8
#endif

#ifndef ESPNOW_MAX_PEERS
#define ESPNOW_MAX_PEERS 20
#endif

#ifndef HEAP_CRITICAL_BYTES
#define HEAP_CRITICAL_BYTES 12288
#endif

#ifndef LINK_DATA_RETRY_MS
#define LINK_DATA_RETRY_MS 400UL
#endif
#ifndef LINK_DATA_MAX_ATTEMPTS
#define LINK_DATA_MAX_ATTEMPTS 5
#endif
#ifndef CHAT_RETRY_MS
#define CHAT_RETRY_MS 500UL
#endif
#ifndef CHAT_MAX_ATTEMPTS
#define CHAT_MAX_ATTEMPTS 4
#endif

// Accept all PLAIN destination packets locally (not only subscribed hashes).
// Forwarding behavior is unchanged; this only affects local app consumption.
#ifndef RNS_ACCEPT_ALL_PLAIN_DESTINATIONS
#define RNS_ACCEPT_ALL_PLAIN_DESTINATIONS 1
#endif

// ESP-NOW channel selection.
// In AP-connected mode use 0 (inherit AP channel). In ESP-NOW-only mode,
// default to channel 1 so all nodes land on a deterministic channel.
#ifndef ESP_NOW_CHANNEL
    #if WIFI_STA_CONNECT_ENABLED
        #define ESP_NOW_CHANNEL 0
    #else
        #define ESP_NOW_CHANNEL 1
    #endif
#endif

// Enable 802.11 LR mode (Long Range) in addition to normal rates.
// All nodes should use the same setting.
#ifndef ESP_NOW_ENABLE_LR
#define ESP_NOW_ENABLE_LR 1
#endif

// Force WiFi TX power to max for ESP-NOW reliability in noisy environments.
// Value unit is 0.25 dBm; 84 => 21 dBm (chip/region limits still apply).
#ifndef ESP_NOW_TX_POWER_QDBM
#define ESP_NOW_TX_POWER_QDBM 84
#endif

