AkitaEngineering/ESP32-C3-Reticulum-Node/include/Config.h
// When set to a non-zero channel number, the firmware will force the WiFi
// radio to that channel before initializing ESP-NOW. This can be useful when
// running in AP-only or STA-only mode without joining an access point, or when
// you want to ensure all nodes operate on a known channel regardless of the
// AP's current channel.
// Usage: add -DESP_NOW_CHANNEL=6 to build_flags or modify Config.h.

// --- WiFi Credentials ---
extern const char *WIFI_SSID; // <<< CHANGE ME in Config.cpp
extern const char *WIFI_PASSWORD; // <<< CHANGE ME in Config.cpp

struct RoutePriorityConfig;

// --- Node Configuration ---
const char* getDefaultDeviceName();
const char* getConfiguredNodeName();
const char* getConfiguredAppName();
const char* getConfiguredWiFiSsid();
const char* getConfiguredWiFiPassword();
const RoutePriorityConfig& getConfiguredRoutePriorities();
void reloadRuntimeConfigCache();
bool hasRuntimeConfigFile();
bool validateRuntimeConfigJson(const String& json, bool requireWifi, bool requireManagement,
                               String* errorReason = nullptr);
bool validateRuntimeConfigFile(bool requireWifi, bool requireManagement,
                               String* errorReason = nullptr);

// Derive Reticulum node address from the chip eFuse MAC on boot.
// This prevents duplicate logical node addresses when flash/EEPROM images are cloned.
#ifndef NODE_ADDRESS_FROM_EFUSE
#define NODE_ADDRESS_FROM_EFUSE 1
#endif

const int EEPROM_ADDR_NODE = 0;  // 8 bytes
const int EEPROM_ADDR_PKTID = 8; // 2 bytes (Start after node address)
// Identity keys stored at offsets 16..83 (see RNSCrypto.h for layout)
const int EEPROM_SIZE = 128;     // Increased for RNS identity keypair storage

// --- Reticulum Network Parameters ---
const size_t RNS_ADDRESS_SIZE = 8;
const size_t RNS_DESTINATION_HASH_SIZE = 16;
// Official Reticulum MTU is 500 bytes. The maximum data payload depends on
// header type: Header1 = 500-19 = 481, Header2 = 500-35 = 465.  We use the
// smaller value so serialised packets never exceed MTU regardless of header.
const size_t RNS_MTU = 500;           // Official Reticulum MTU
const size_t RNS_MAX_PAYLOAD = 465;   // Conservative: MTU - HEADER_2_SIZE (35)
const uint16_t RNS_UDP_PORT = 4242;   // Default Reticulum UDP port
const uint8_t MAX_HOPS = 128;         // Official PATHFINDER_M (Transport.py)

// Default RNS application name used for destination hash computation.
// When JSON runtime config is enabled this can be overridden via `rns_app_name`
// in the saved config.
#ifndef RNS_APP_NAME
#define RNS_APP_NAME "esp32.node"
#endif

// --- Timing & Intervals (milliseconds) ---
const uint16_t PACKET_ID_SAVE_INTERVAL = 100; // Save counter every N packets generated
#ifndef ANNOUNCE_INTERVAL_DEFAULT_MS
#define ANNOUNCE_INTERVAL_DEFAULT_MS 30000UL // Announce every 30s by default for faster route convergence
#endif
const unsigned long ANNOUNCE_INTERVAL_MS = ANNOUNCE_INTERVAL_DEFAULT_MS;
const unsigned long ROUTE_TIMEOUT_MS = ANNOUNCE_INTERVAL_MS * 3 + 15000; // Timeout after ~3 missed announces
const unsigned long PRUNE_INTERVAL_MS = ANNOUNCE_INTERVAL_MS / 2; // Check for old routes periodically
const unsigned long MEM_CHECK_INTERVAL_MS = 15000; // Check memory every 15 seconds
const unsigned long RECENT_ANNOUNCE_TIMEOUT_MS = ANNOUNCE_INTERVAL_MS / 2; // How long to remember forwarded announces

// --- Link Layer Parameters ---
const unsigned long LINK_INACTIVITY_TIMEOUT_MS = ROUTE_TIMEOUT_MS * 2; // Timeout for closing inactive links
#ifndef LINK_MAX_ACTIVE
#define LINK_MAX_ACTIVE 20
#endif

static_assert(LINK_MAX_ACTIVE > 0, "LINK_MAX_ACTIVE must be at least 1");

// --- Routing & Limits ---
// Resource caps, not a sold fleet size. Two nodes is enough to mesh; more
// nodes work until these tables or the airtime fill. MAX_ROUTES is candidate
// paths (several per destination). Heard-neighbor tracking is diagnostic only
// because ESP-NOW TX is broadcast.
#ifndef MAX_ROUTES
#define MAX_ROUTES 64
#endif
#ifndef MAX_RECENT_ANNOUNCES
#define MAX_RECENT_ANNOUNCES 80
#endif
#ifndef MAX_HEARD_NEIGHBORS
#define MAX_HEARD_NEIGHBORS 32
#endif

static_assert(MAX_ROUTES >= 8, "MAX_ROUTES must allow a small multi-path mesh");
static_assert(MAX_RECENT_ANNOUNCES >= 16, "MAX_RECENT_ANNOUNCES must cover an announce burst");
static_assert(MAX_HEARD_NEIGHBORS >= 8, "MAX_HEARD_NEIGHBORS must track nearby radios");

// Route selection policy: lower hop count wins first, then interface priority,
// then most recent route update. Override these in build flags to tailor field
// failover behavior for a deployment.
#ifndef ROUTE_PRIORITY_WIFI_UDP
#define ROUTE_PRIORITY_WIFI_UDP 50
#endif
#ifndef ROUTE_PRIORITY_ESP_NOW
#define ROUTE_PRIORITY_ESP_NOW 40
#endif
#ifndef ROUTE_PRIORITY_LORA
#define ROUTE_PRIORITY_LORA 30
#endif
#ifndef ROUTE_PRIORITY_HAM_MODEM
#define ROUTE_PRIORITY_HAM_MODEM 25
#endif
#ifndef ROUTE_PRIORITY_SERIAL_PORT
#define ROUTE_PRIORITY_SERIAL_PORT 15
#endif
#ifndef ROUTE_PRIORITY_BLUETOOTH
#define ROUTE_PRIORITY_BLUETOOTH 10
#endif
#ifndef ROUTE_PRIORITY_IPFS
#define ROUTE_PRIORITY_IPFS 5
#endif

struct RoutePriorityConfig {
    int wifi_udp = ROUTE_PRIORITY_WIFI_UDP;
    int esp_now = ROUTE_PRIORITY_ESP_NOW;
    int lora = ROUTE_PRIORITY_LORA;
    int ham_modem = ROUTE_PRIORITY_HAM_MODEM;
    int serial_port = ROUTE_PRIORITY_SERIAL_PORT;
    int bluetooth = ROUTE_PRIORITY_BLUETOOTH;
    int ipfs = ROUTE_PRIORITY_IPFS;
};

// compile‑time sanity
static_assert(MAX_ROUTES > 0, "MAX_ROUTES must be positive");
static_assert(MAX_RECENT_ANNOUNCES > 0, "MAX_RECENT_ANNOUNCES must be positive");

// --- Group Addresses ---
// Define groups this node belongs to. Example:
const std::vector<std::array<uint8_t, RNS_DESTINATION_HASH_SIZE>> SUBSCRIBED_GROUPS = {
    // Add complete 16-byte Reticulum destination hashes here.
};

// --- LoRa Configuration ---
#ifdef LORA_ENABLED
    // Heltec LoRa32 v3 (ESP32-S3) pin definitions
    #if defined(HELTEC_LORA32_V3)
        #define LORA_CS_PIN 8
        #define LORA_RST_PIN 12
        #define LORA_DIO0_PIN 14
        #define LORA_SPI_SCK 9
        #define LORA_SPI_MISO 11
        #define LORA_SPI_MOSI 10
        #define LORA_FREQUENCY 915.0  // MHz (adjust for your region)
    // Heltec LoRa32 v4 (ESP32-C6) pin definitions
    #elif defined(HELTEC_LORA32_V4)
        #define LORA_CS_PIN 8
        #define LORA_RST_PIN 12
        #define LORA_DIO0_PIN 14
        #define LORA_SPI_SCK 9
        #define LORA_SPI_MISO 11
        #define LORA_SPI_MOSI 10
        #define LORA_FREQUENCY 915.0  // MHz (adjust for your region)
    // Generic LoRa configuration (customize for your board)
    #else
        #define LORA_CS_PIN 5
        #define LORA_RST_PIN 14
        #define LORA_DIO0_PIN 2
        #define LORA_SPI_SCK 18
        #define LORA_SPI_MISO 19
        #define LORA_SPI_MOSI 23
        #define LORA_FREQUENCY 915.0  // MHz (adjust for your region)
    #endif
    
    #define LORA_BANDWIDTH 125.0  // kHz
    #define LORA_SPREADING_FACTOR 7
    #define LORA_CODING_RATE 5
    #define LORA_SYNC_WORD 0x12
    #define LORA_OUTPUT_POWER 10  // dBm
    #define LORA_PREAMBLE_LENGTH 8
    #define LORA_GAIN 0  // 0 = automatic gain control
#endif

// --- HAM Modem Configuration ---
#ifdef HAM_MODEM_ENABLED
    // HAM modem interface configuration
    // Most HAM TNCs use KISS protocol over serial, which we already support
    // This enables additional HAM-specific features like APRS, AX.25, etc.
    #define HAM_MODEM_SERIAL Serial1  // Use a separate serial port for HAM modem
    #define HAM_MODEM_BAUD 9600       // Standard TNC baud rate (adjust as needed)
    #define HAM_MODEM_RX_PIN 4         // Adjust for your board
    #define HAM_MODEM_TX_PIN 5         // Adjust for your board
    
    // APRS (Automatic Packet Reporting System) configuration
    #define APRS_ENABLED 1
    #define APRS_CALLSIGN "N0CALL"     // <<< CHANGE ME: Your HAM callsign
    #define APRS_SSID 0                // APRS SSID (0-15)
    #define APRS_SYMBOL "["            // APRS symbol (see APRS spec)
    #define APRS_COMMENT "Reticulum"    // APRS comment field
    
    // Audio Modem Configuration
    #define AUDIO_MODEM_ENABLED 1
    #define AUDIO_MODEM_SAMPLE_RATE 8000  // Hz (8kHz typical for AFSK)
    #define AUDIO_MODEM_MARK_FREQ 1200     // Hz (Bell 202 mark frequency)
    #define AUDIO_MODEM_SPACE_FREQ 2200    // Hz (Bell 202 space frequency)
    #define AUDIO_MODEM_BAUD_RATE 1200     // baud (Bell 202 standard)
    #define AUDIO_MODEM_RX_PIN 34          // ADC pin for audio input
    #define AUDIO_MODEM_TX_PIN 25          // DAC pin for audio output (ESP32)
    
    // AX.25 Protocol Configuration
    #define AX25_ENABLED 1
    #define AX25_MAX_FRAME_SIZE 330        // Max AX.25 frame size
    #define AX25_DEFAULT_TX_DELAY 10       // TX delay in 10ms units
    #define AX25_DEFAULT_PERSISTENCE 63    // Persistence parameter (0-255)
    #define AX25_DEFAULT_SLOT_TIME 0      // Slot time in 10ms units
    #define AX25_DEFAULT_TX_TAIL 5        // TX tail in 10ms units
    #define AX25_DEFAULT_FULL_DUPLEX 0    // 0 = half duplex, 1 = full duplex
    
    // Winlink Configuration
    #define WINLINK_ENABLED 1
    #define WINLINK_BBS_CALLSIGN "N0BBS"   // <<< CHANGE ME: Winlink BBS callsign
    #define WINLINK_PASSWORD ""            // <<< CHANGE ME: Winlink password (if required)
#endif

// HAM_MODEM_ENABLED currently also enables the board-specific audio modem and
// experimental Winlink adapter above. Keep that bundle out of release builds
// until it has its own hardware and protocol-interoperability acceptance suite.
#if PRODUCTION_BUILD && defined(HAM_MODEM_ENABLED)
#error "HAM_MODEM_ENABLED is not production-qualified"
#endif

// --- IPFS Configuration ---
#ifdef IPFS_ENABLED
    // IPFS gateway configuration (lightweight client approach)
    #define IPFS_GATEWAY_URL "https://ipfs.io/ipfs/"  // Public IPFS gateway
    // Alternative gateways: "https://gateway.pinata.cloud/ipfs/", "https://dweb.link/ipfs/"
    #define IPFS_MAX_CONTENT_SIZE 10240  // Max content size to fetch (10KB, adjust based on memory)
    #define IPFS_TIMEOUT_MS 10000        // HTTP request timeout
    #define IPFS_CACHE_SIZE 5            // Number of IPFS objects to cache in memory
    
