AkitaEngineering/ESP32-C3-Reticulum-Node/include/Config.h
    // IPFS Local Node API (for publishing)
    #define IPFS_LOCAL_NODE_URL "http://localhost:5001"  // Local IPFS node API
    #define IPFS_LOCAL_NODE_ENABLED 0    // Set to 1 if you have a local IPFS node
    #define IPFS_PUBLISH_TIMEOUT_MS 30000 // Publishing timeout (longer for large files)
#endif

// --- Interface Identifiers ---
enum class InterfaceType {
    UNKNOWN,
    LOCAL, // For packets originating from this node
    SERIAL_PORT,
    BLUETOOTH,
    ESP_NOW,
    WIFI_UDP,
    LORA,
    HAM_MODEM,  // HAM radio modem interface
    IPFS         // IPFS content addressing (virtual interface)
};

// --- Packet Contexts — official values from RNS/Packet.py ---
#define RNS_CONTEXT_NONE           0x00  // Generic data packet
#define RNS_CONTEXT_RESOURCE       0x01  // Resource transfer
#define RNS_CONTEXT_RESOURCE_ADV   0x02  // Resource advertisement
#define RNS_CONTEXT_RESOURCE_REQ   0x03  // Resource part request
#define RNS_CONTEXT_RESOURCE_HMU   0x04  // Resource hashmap update
#define RNS_CONTEXT_RESOURCE_PRF   0x05  // Resource proof
#define RNS_CONTEXT_RESOURCE_ICL   0x06  // Resource initiator cancel
#define RNS_CONTEXT_RESOURCE_RCL   0x07  // Resource receiver cancel
#define RNS_CONTEXT_CACHE_REQUEST  0x08  // Cache request
#define RNS_CONTEXT_REQUEST        0x09  // Request
#define RNS_CONTEXT_RESPONSE       0x0A  // Response to request
#define RNS_CONTEXT_PATH_RESPONSE  0x0B  // Path response
#define RNS_CONTEXT_COMMAND        0x0C  // Command
#define RNS_CONTEXT_COMMAND_STATUS 0x0D  // Command status
#define RNS_CONTEXT_CHANNEL        0x0E  // Link channel data
#define RNS_CONTEXT_KEEPALIVE      0xFA  // Keepalive
#define RNS_CONTEXT_LINKIDENTIFY   0xFB  // Link peer identification proof
#define RNS_CONTEXT_LINKCLOSE      0xFC  // Link close message
#define RNS_CONTEXT_LINKPROOF      0xFD  // Link packet proof
#define RNS_CONTEXT_LRRTT          0xFE  // Link request round-trip time
#define RNS_CONTEXT_LRPROOF        0xFF  // Link request proof

#define RNS_CONTEXT_LOCAL_CMD   0xB0  // Local commands via KISS (node-specific, never on-air)


#endif // CONFIG_H
